from django.db import models
from django.utils.translation import gettext_lazy as _

class SystemWorkMode(models.TextChoices):

    # --- 1. Dynamic Local Balancing ---
    
    # Режим "Само Слънце" - Използва се когато батерията не е достатъчно пълна.
    # Всичката излишна слънчева енергия отива за колата, но батерията не се разрежда към нея.
    DYNAMIC_ECO_SOLAR_ONLY = 'DYNAMIC_ECO_SOLAR_ONLY', _('Динамичен: Само Слънце (Предпазване на батерията)')
    
    # Режим "Максимално Бързо Възобновяемо Зареждане" - Използва се когато времето е хубаво и батерията е над 50/60%.
    # Колата максимално бързо се зарежда до 80%, използвайки целия излишък от Слънцето + подкрепа от Батерията. Без Мрежа!
    DYNAMIC_MAX_RENEWABLE = 'DYNAMIC_MAX_RENEWABLE', _('Динамичен: Бързо ЕКО (Слънце + Батерия)')
    
    # --- 2. Grid & Override Modes ---
    
    # Максимална мощност отвсякъде (Слънце + Батерия + Мрежа)
    FAST_CHARGE_GRID = 'FAST_CHARGE_GRID', _('Смесено: Бързо зареждане с Мрежа')
    
    # Запазване на батерията през нощната тарифа (Използваме мрежа за колата или спираме колата)
    PROTECT_BATTERY = 'PROTECT_BATTERY', _('Защита Батерия (Нощна тарифа)')
    
    # Приоритетно зареждане на батерията от слънцето (Силно слънце и нормален товар)
    CHARGE_BATTERY = 'CHARGE_BATTERY', _('Приоритетно Зареждане Батерия')
    
    # При прекъсване на мрежата
    EMERGENCY_BACKUP = 'EMERGENCY_BACKUP', _('Авариен Островен Режим')
